zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE327/startup_MCXE327_cm7_core1.cpp
WEAK void FlexCAN1_1_IRQHandler(void)
{
    FLEXCAN_DriverDataIRQHandler(1U, 0U, 31U);
}

WEAK void FlexCAN1_2_IRQHandler(void)
{
    FLEXCAN_DriverDataIRQHandler(1U, 32U, 63U);
}

WEAK void FlexCAN2_0_IRQHandler(void)
{
    FLEXCAN_DriverEventIRQHandler(2U);
}

WEAK void FlexCAN2_1_IRQHandler(void)
{
    FLEXCAN_DriverDataIRQHandler(2U, 0U, 31U);
}

WEAK void FlexCAN2_2_IRQHandler(void)
{
    FLEXCAN_DriverDataIRQHandler(2U, 32U, 63U);
}

WEAK void FlexCAN3_0_IRQHandler(void)
{
    FLEXCAN_DriverEventIRQHandler(3U);
}

WEAK void FlexCAN3_1_IRQHandler(void)
{
    FLEXCAN_DriverDataIRQHandler(3U, 0U, 31U);
}

WEAK void Reserved137_IRQHandler(void)
{
    Reserved137_DriverIRQHandler();
}

WEAK void Reserved138_IRQHandler(void)
{
    Reserved138_DriverIRQHandler();
}

WEAK void Reserved139_IRQHandler(void)
{
    Reserved139_DriverIRQHandler();
}

WEAK void Reserved140_IRQHandler(void)
{
    Reserved140_DriverIRQHandler();
}

WEAK void Reserved141_IRQHandler(void)
{
    Reserved141_DriverIRQHandler();
}

WEAK void Reserved142_IRQHandler(void)
{
    Reserved142_DriverIRQHandler();
}

WEAK void Reserved143_IRQHandler(void)
{
    Reserved143_DriverIRQHandler();
}

WEAK void Reserved144_IRQHandler(void)
{
    Reserved144_DriverIRQHandler();
}

WEAK void Reserved145_IRQHandler(void)
{
    Reserved145_DriverIRQHandler();
}

WEAK void Reserved146_IRQHandler(void)
{
    Reserved146_DriverIRQHandler();
}

WEAK void Reserved147_IRQHandler(void)
{
    Reserved147_DriverIRQHandler();
}

WEAK void Reserved148_IRQHandler(void)
{
    Reserved148_DriverIRQHandler();
}

WEAK void Reserved149_IRQHandler(void)
{
    Reserved149_DriverIRQHandler();
}

WEAK void Reserved150_IRQHandler(void)
{
    Reserved150_DriverIRQHandler();
}

WEAK void Reserved151_IRQHandler(void)
{
    Reserved151_DriverIRQHandler();
}

WEAK void Reserved152_IRQHandler(void)
{
    Reserved152_DriverIRQHandler();
}

WEAK void Reserved153_IRQHandler(void)
{
    Reserved153_DriverIRQHandler();
}

WEAK void Reserved154_IRQHandler(void)
{
    Reserved154_DriverIRQHandler();
}

WEAK void FLEXIO_IRQHandler(void)
{
    FLEXIO_DriverIRQHandler();
}

WEAK void Reserved156_IRQHandler(void)
{
    Reserved156_DriverIRQHandler();
}

WEAK void LPUART_0_IRQHandler(void)
{
    LPUART_DriverIRQHandler(0U);
}

WEAK void LPUART_1_IRQHandler(void)
{
    LPUART_DriverIRQHandler(1U);
}

WEAK void LPUART_2_IRQHandler(void)
{
    LPUART_DriverIRQHandler(2U);
}

WEAK void LPUART_3_IRQHandler(void)
{
    LPUART_DriverIRQHandler(3U);
}

WEAK void Reserved161_IRQHandler(void)
{
    Reserved161_DriverIRQHandler();
}

WEAK void Reserved162_IRQHandler(void)
{
    Reserved162_DriverIRQHandler();
}

WEAK void Reserved163_IRQHandler(void)
{
    Reserved163_DriverIRQHandler();
}

WEAK void Reserved164_IRQHandler(void)
{
    Reserved164_DriverIRQHandler();
}

WEAK void Reserved165_IRQHandler(void)
{
    Reserved165_DriverIRQHandler();
}

WEAK void Reserved166_IRQHandler(void)
{
    Reserved166_DriverIRQHandler();
}

WEAK void Reserved167_IRQHandler(void)
{
    Reserved167_DriverIRQHandler();
}

WEAK void Reserved168_IRQHandler(void)
{
    Reserved168_DriverIRQHandler();
}

WEAK void Reserved169_IRQHandler(void)
{
    Reserved169_DriverIRQHandler();
}

WEAK void Reserved170_IRQHandler(void)
{
    Reserved170_DriverIRQHandler();
}

WEAK void Reserved171_IRQHandler(void)
{
    Reserved171_DriverIRQHandler();
}

WEAK void Reserved172_IRQHandler(void)
{
    Reserved172_DriverIRQHandler();
}

WEAK void Reserved173_IRQHandler(void)
{
    Reserved173_DriverIRQHandler();
}

WEAK void Reserved174_IRQHandler(void)
{
    Reserved174_DriverIRQHandler();
}

WEAK void Reserved175_IRQHandler(void)
{
    Reserved175_DriverIRQHandler();
}

WEAK void Reserved176_IRQHandler(void)
{
    Reserved176_DriverIRQHandler();
}

WEAK void LPI2C0_IRQHandler(void)
{
    LPI2C_DriverIRQHandler(0U);
}

WEAK void LPI2C1_IRQHandler(void)
{
    LPI2C_DriverIRQHandler(1U);
}

WEAK void Reserved179_IRQHandler(void)
{
    Reserved179_DriverIRQHandler();
}

WEAK void Reserved180_IRQHandler(void)
{
    Reserved180_DriverIRQHandler();
}

WEAK void LPSPI0_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(0U);
}

WEAK void LPSPI1_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(1U);
}

WEAK void LPSPI2_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(2U);
}

WEAK void LPSPI3_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(3U);
}

WEAK void Reserved185_IRQHandler(void)
{
    Reserved185_DriverIRQHandler();
}

WEAK void Reserved186_IRQHandler(void)
{
    Reserved186_DriverIRQHandler();
}

WEAK void Reserved187_IRQHandler(void)
{
    Reserved187_DriverIRQHandler();
}

WEAK void Reserved188_IRQHandler(void)
{
    Reserved188_DriverIRQHandler();
}

WEAK void QSPI_IRQHandler(void)
{
    QSPI_DriverIRQHandler();
}

WEAK void SAI0_IRQHandler(void)
{
    SAI_DriverIRQHandler(0U);
}

WEAK void SAI1_IRQHandler(void)
{
    SAI_DriverIRQHandler(1U);
}

WEAK void Reserved192_IRQHandler(void)
{
    Reserved192_DriverIRQHandler();
}

WEAK void Reserved193_IRQHandler(void)
{
    Reserved193_DriverIRQHandler();
}

WEAK void JDC_IRQHandler(void)
{
    JDC_DriverIRQHandler();
}

WEAK void Reserved195_IRQHandler(void)
{
    Reserved195_DriverIRQHandler();
}

WEAK void ADC0_IRQHandler(void)
{
    ADC0_DriverIRQHandler();
}

WEAK void ADC1_IRQHandler(void)
{
    ADC1_DriverIRQHandler();
}

WEAK void Reserved198_IRQHandler(void)
{
    Reserved198_DriverIRQHandler();
}

WEAK void CMP0_IRQHandler(void)
{
    CMP0_DriverIRQHandler();
}

WEAK void CMP1_IRQHandler(void)
{
    CMP1_DriverIRQHandler();
}

WEAK void Reserved201_IRQHandler(void)
{
    Reserved201_DriverIRQHandler();
}

WEAK void Reserved202_IRQHandler(void)
{
    Reserved202_DriverIRQHandler();
}

WEAK void Reserved203_IRQHandler(void)
{
    Reserved203_DriverIRQHandler();
}

WEAK void Reserved204_IRQHandler(void)
{
    Reserved204_DriverIRQHandler();
}

WEAK void FCCU_0_IRQHandler(void)
{
    FCCU_0_DriverIRQHandler();
}

WEAK void FCCU_1_IRQHandler(void)
{
    FCCU_1_DriverIRQHandler();
}

WEAK void STCU_IRQHandler(void)
{
    STCU_DriverIRQHandler();
}

WEAK void MU0_B_TX_IRQHandler(void)
{
    MU0_B_TX_DriverIRQHandler();
}

